---
kind: property
id: P:Autodesk.Revit.DB.ReferenceWithContext.Proximity
source: html/df3b73ef-3dff-c2d4-885f-1535d0871a45.htm
---
# Autodesk.Revit.DB.ReferenceWithContext.Proximity Property

The proximity value to the ray's origin when the reference is returned by FindReferencesWithContextByDirection(XYZ, XYZ, View3D) or ReferenceIntersector.Find(XYZ, XYZ).

## Syntax (C#)
```csharp
public double Proximity { get; }
```